interface IPreset {
    characters: Array<{
        key: string
        element: string
        presets: string[]
    }>
    presets: {
        [name: string]: {
            [minor: string]: number
        }
    }

}

export default <IPreset>{
    characters: [
        {
            key: "Albedo", element: "geo", presets: ['阿贝多 | 辰砂之纺锤 | 华馆4 | 防岩暴',
                '阿贝多 | 辰砂之纺锤 | 磐岩4 | 防岩暴',
                '阿贝多 | 辰砂之纺锤 | 千岩4 | 防岩暴',]
        },
        { key: "Aloy", element: "cryo", presets: ['埃洛伊 | 西风猎弓 | 2冰风2角斗 | 攻冰暴',] },
        {
            key: "Amber", element: "pyro", presets: ['安柏 | 终末嗟叹之诗 | 宗室4 | 攻火暴',
                '安柏 | 阿莫斯之弓 | 乐团4 | 攻火暴',]
        },
        {
            key: "AratakiItto", element: "geo", presets: ['荒泷一斗 | 赤角石溃杵 | 华馆4 | 防岩暴',
                '荒泷一斗 | 螭骨剑 | 华馆4 | 防岩暴',
                '荒泷一斗 | 白影剑 | 华馆4 | 防岩暴',]
        },
        {
            key: "Barbara", element: "hydro", presets: ['芭芭拉 | 不灭月华 | 少女4 | 生生治',
                '芭芭拉 | 讨龙英杰谭 | 少女4 | 生生治',
                '芭芭拉 | 试做金珀 | 少女4 | 生生治',]
        },
        {
            key: "Beidou", element: "electro", presets: ['北斗 | 狼的末路 | 旗印4 | 充雷暴',
                '北斗 | 螭骨剑 | 旗印4 | 充攻暴',]
        },
        {
            key: "Bennett", element: "pyro", presets: ['班尼特 | 风鹰剑 | 宗室4 | 充火暴',
                '班尼特 | 天空之刃 | 宗室4 | 充火暴',
                '班尼特 | 风鹰剑 | 少女4 | 充生治',
                '班尼特 | 天空之刃 | 少女4 | 充生治',]
        },
        {
            key: "Chongyun", element: "cryo", presets: ['重云 | 狼的末路 | 2冰风2宗室 | 攻冰暴',
                '重云 | 螭骨剑 | 2冰风2宗室 | 攻冰暴',]
        },
        {
            key: "Diluc", element: "pyro", presets: ['迪卢克 | 狼的末路 | 魔女4 | 精火暴',
                '迪卢克 | 螭骨剑 | 魔女4 | 攻火暴',]
        },
        { key: "Diona", element: "cryo", presets: ['迪奥娜 | 祭礼弓 | 2少女2千岩 | 生生生',] },
        {
            key: "Eula", element: "cryo", presets: ['优菈 | 松籁响起之时 | 苍白4 | 攻物暴',
                '优菈 | 狼的末路 | 苍白4 | 攻物暴',
                '优菈 | 螭骨剑 | 苍白4 | 攻物暴',]
        },
        {
            key: "Fischl", element: "electro", presets: ['菲谢尔 | 绝弦 | 2如雷2角斗 | 攻雷暴',
                '菲谢尔 | 天空之翼 | 2如雷2角斗 | 攻雷暴',]
        },
        {
            key: "Ganyu", element: "cryo", presets: ['甘雨 | 阿莫斯之弓 | 冰风4 | 攻冰暴',
                '甘雨 | 破魔之弓 | 冰风4 | 攻冰暴',
                '甘雨 | 试做澹月 | 冰风4 | 攻冰暴',
                '甘雨 | 阿莫斯之弓 | 乐团4 | 攻冰暴',
                '甘雨 | 破魔之弓 | 乐团4 | 攻冰暴',
                '甘雨 | 试做澹月 | 乐团4 | 攻冰暴',]
        },
        { key: "Gorou", element: "geo", presets: ['五郎 | 西风猎弓 | 流放4 | 充岩暴',] },
        {
            key: "HuTao", element: "pyro", presets: ['胡桃 | 护摩之杖 | 追忆4 | 生火暴',
                '胡桃 | 护摩之杖 | 追忆4 | 精火暴',
                '胡桃 | 匣里灭辰 | 追忆4 | 生火暴',
                '胡桃 | 匣里灭辰 | 追忆4 | 精火暴',
                '胡桃 | 护摩之杖 | 魔女4 | 生火暴',
                '胡桃 | 护摩之杖 | 魔女4 | 精火暴',
                '胡桃 | 匣里灭辰 | 魔女4 | 生火暴',
                '胡桃 | 匣里灭辰 | 魔女4 | 精火暴',]
        },
        {
            key: "Jean", element: "anemo", presets: ['琴 | 腐殖之剑 | 2翠绿2角斗 | 攻攻治',
                '琴 | 西风剑 | 2翠绿2角斗 | 攻攻治',
                '琴 | 风鹰剑 | 2翠绿2角斗 | 充攻治',]
        },
        {
            key: "KaedeharaKazuha", element: "anemo", presets: ['枫原万叶 | 苍古自由之誓 | 翠绿4 | 精精精',
                '枫原万叶 | 铁蜂刺 | 翠绿4 | 精精精',]
        },
        {
            key: "Kaeya", element: "cryo", presets: ['凯亚 | 西风剑 | 旗印4 | 攻冰暴',
                '凯亚 | 磐岩结绿 | 旗印4 | 充冰暴',]
        },
        {
            key: "KamisatoAyaka", element: "cryo", presets: ['神里绫华 | 雾切之回光 | 冰风4 | 攻冰暴',
                '神里绫华 | 天目影打刀 | 冰风4 | 攻冰暴',]
        },
        {
            key: "KamisatoAyato", element: "hydro", presets: ['神里绫人 | 波乱月白经津 | 回响4 | 攻水暴',
                '神里绫人 | 磐岩结绿 | 沉沦4 | 攻水暴',
                '神里绫人 | 黑剑 | 回响4 | 攻水暴',]
        },
        {
            key: "Keqing", element: "electro", presets: ['刻晴 | 雾切之回光 | 2如雷2角斗 | 攻雷暴',
                '刻晴 | 磐岩结绿 | 2如雷2角斗 | 攻雷暴',
                '刻晴 | 匣里龙吟 | 2如雷2角斗 | 攻雷暴',]
        },
        {
            key: "Klee", element: "pyro", presets: ['可莉 | 四风原典 | 魔女4 | 攻火暴',
                '可莉 | 流浪乐章 | 魔女4 | 攻火暴',]
        },
        {
            key: "KujouSara", element: "electro", presets: ['九条裟罗 | 天空之翼 | 旗印4 | 充雷暴',
                '九条裟罗 | 祭礼弓 | 旗印4 | 充雷暴',]
        },
        {
            key: "Lisa", element: "electro", presets: ['丽莎 | 四风原典 | 2雷2角斗 | 攻雷暴',
                '丽莎 | 流浪乐章 | 宗室4 | 攻雷暴',]
        },
        {
            key: "Mona", element: "hydro", presets: ['莫娜 | 流浪乐章 | 旗印4 | 攻水暴',
                '莫娜 | 讨龙英杰谭 | 宗室4 | 充水暴',
                '莫娜 | 试做金珀 | 宗室4 | 充水暴',]
        },
        {
            key: "Ningguang", element: "geo", presets: ['凝光 | 四风原典 | 2磐岩2角斗 | 攻岩暴',
                '凝光 | 尘世之锁 | 2磐岩2角斗 | 攻岩暴',
                '凝光 | 流浪乐章 | 2磐岩2角斗 | 攻岩暴',]
        },
        {
            key: "Noelle", element: "geo", presets: ['诺艾尔 | 赤角石溃杵 | 华馆4 | 防岩暴',
                '诺艾尔 | 螭骨剑 | 华馆4 | 防岩暴',
                '诺艾尔 | 白影剑 | 华馆4 | 防岩暴',]
        },
        {
            key: "Qiqi", element: "cryo", presets: ['七七 | 祭礼剑 | 海染4 | 攻攻治',
                '七七 | 风鹰剑 | 海染4 | 攻攻治',
                '七七 | 笛剑 | 海染4 | 攻攻治',]
        },
        {
            key: "RaidenShogun", element: "electro", presets: ['雷电将军 | 薙草之稻光 | 旗印4 | 充雷暴',
                '雷电将军 | 渔获 | 旗印4 | 充攻暴',]
        },
        {
            key: "Razor", element: "electro", presets: ['雷泽 | 螭骨剑 | 角斗4 | 攻物暴',
                '雷泽 | 狼的末路 | 角斗4 | 攻物暴',]
        },
        { key: "Rosaria", element: "cryo", presets: ['罗莎莉亚 | 西风长枪 | 宗室4 | 攻冰暴',] },
        {
            key: "SangonomiyaKokomi", element: "hydro", presets: ['珊瑚宫心海 | 不灭月华 | 海染4 | 生水治',
                '珊瑚宫心海 | 试做金珀 | 海染4 | 生水治',
                '珊瑚宫心海 | 讨龙英杰谭 | 千岩4 | 生生治',
                '珊瑚宫心海 | 试做金珀 | 千岩4 | 生生治',]
        },
        {
            key: "Sayu", element: "anemo", presets: ['早柚 | 狼的末路 | 翠绿4 | 精攻治',
                '早柚 | 西风大剑 | 翠绿4 | 精攻治',]
        },
        {
            key: "Shenhe", element: "cryo", presets: ['申鹤 | 息灾 | 2角斗2追忆 | 攻攻攻',
                '申鹤 | 薙草之稻光 | 2角斗2追忆 | 攻攻攻',
                '申鹤 | 天空之脊 | 2角斗2追忆 | 攻攻攻',
                '申鹤 | 西风长枪 | 2角斗2追忆 | 攻攻攻',]
        },
        {
            key: "Sucrose", element: "anemo", presets: ['砂糖 | 祭礼残章 | 翠绿4 | 充精精',
                '砂糖 | 试做金珀 | 翠绿4 | 充精精',
                '砂糖 | 讨龙英杰谭 | 翠绿4 | 充精精',]
        },
        {
            key: "Tartaglia", element: "hydro", presets: ['达达利亚 | 冬极百星 | 2沉沦2角斗 | 攻水暴',
                '达达利亚 | 天空之翼 | 2沉沦2角斗 | 攻水暴',
                '达达利亚 | 弓藏 | 2沉沦2角斗 | 攻水暴',]
        },
        {
            key: "Thoma", element: "pyro", presets: ['托马 | 西风长枪 | 2旗印2千岩 | 充生暴',
                '托马 | 黑缨枪 | 2旗印2千岩 | 充生生',]
        },
        {
            key: "Traveler", element: "", presets: ['空/荧（风） | 西风剑 | 翠绿4 | 精精精',
                '空/荧（雷） | 西风剑 | 旗印4 | 充雷暴',
                '空/荧（岩） | 雾切之回光 | 2磐岩2角斗 | 攻岩暴',
                '空/荧（岩） | 磐岩结绿 | 2磐岩2角斗 | 攻岩暴',
                '空/荧（岩） | 黑剑 | 2磐岩2角斗 | 攻岩暴',]
        },
        {
            key: "TravelerAnemo", element: "anemo", presets: ['空/荧（风） | 西风剑 | 翠绿4 | 精精精',]
        },
        {
            key: "TravelerGeo", element: "geo", presets: ['空/荧（岩） | 雾切之回光 | 2磐岩2角斗 | 攻岩暴',
            '空/荧（岩） | 磐岩结绿 | 2磐岩2角斗 | 攻岩暴',
            '空/荧（岩） | 黑剑 | 2磐岩2角斗 | 攻岩暴',]
        },
        {
            key: "TravelerElectro", element: "electro", presets: ['空/荧（雷） | 西风剑 | 旗印4 | 充雷暴',]
        },
        {
            key: "Venti", element: "anemo", presets: ['温迪 | 终末嗟叹之诗 | 翠绿4 | 精精精',
                '温迪 | 西风猎弓 | 翠绿4 | 精精精',
                '温迪 | 绝弦 | 翠绿4 | 充精精',]
        },
        {
            key: "Xiangling", element: "pyro", presets: ['香菱 | 天空之脊 | 旗印4 | 充火暴',
                '香菱 | 天空之脊 | 旗印4 | 精火暴',
                '香菱 | 渔获 | 旗印4 | 充火暴',
                '香菱 | 渔获 | 旗印4 | 精火暴',]
        },
        {
            key: "Xiao", element: "anemo", presets: ['魈 | 和璞鸢 | 辰砂4 | 攻风暴',
                '魈 | 护摩之杖 | 辰砂4 | 攻风暴',
                '魈 | 决斗之枪 | 2翠绿2角斗 | 攻风暴',]
        },
        {
            key: "Xingqiu", element: "hydro", presets: ['行秋 | 祭礼剑 | 2沉沦2宗室 | 攻水暴',
                '行秋 | 磐岩结绿 | 旗印4 | 充水暴',]
        },
        {
            key: "Xinyan", element: "pyro", presets: ['辛焱 | 无工之剑 | 2苍白2骑士 | 攻物暴',
                '辛焱 | 白影剑 | 2苍白2骑士 | 攻物暴',
                '辛焱 | 祭礼大剑 | 千岩4 | 防防防',
                '辛焱 | 白影剑 | 千岩4 | 防防防',]
        },
        {
            key: "YaeMiko", element: "electro", presets: ['八重神子 | 神乐之真意 | 平雷4 | 攻雷暴',
                '八重神子 | 天空之卷 | 平雷4 | 攻雷暴',
                '八重神子 | 匣里日月 | 平雷4 | 攻雷暴',
                '八重神子 | 流浪乐章 | 平雷4 | 攻雷暴',]
        },
        {
            key: "Yanfei", element: "pyro", presets: ['烟绯 | 四风原典 | 乐团4 | 攻火暴',
                '烟绯 | 流浪乐章 | 乐团4 | 攻火暴',]
        },
        {
            key: "Yoimiya", element: "pyro", presets: ['宵宫 | 飞雷之弦振 | 追忆4 | 攻火暴',
                '宵宫 | 弓藏 | 追忆4 | 攻火暴',]
        },
        {
            key: "YunJin", element: "geo", presets: ['云堇 | 薙草之稻光 | 华馆4 | 防防防',
                '云堇 | 天空之脊 | 华馆4 | 防防防',
                '云堇 | 西风长枪 | 华馆4 | 防防暴']
        },
        {
            key: "Zhongli", element: "geo", presets: ['钟离 | 黑缨枪 | 千岩4 | 生生生',
                '钟离 | 护摩之杖 | 千岩4 | 生生生',
                '钟离 | 护摩之杖 | 2磐岩2宗室 | 生岩暴',]
        },
    ],
    presets: {
        '胡桃 | 护摩之杖 | 追忆4 | 生火暴': {
            'hp': 0.1617,
            'atk': 0.1356,
            'def': 0.0,
            'hpp': 0.4911,
            'atkp': 0.2905,
            'defp': 0.0,
            'em': 1.0,
            'er': 0.0,
            'cr': 0.9238,
            'cd': 0.7173
        },
        '胡桃 | 护摩之杖 | 追忆4 | 精火暴': {
            'hp': 0.2033,
            'atk': 0.1706,
            'def': 0.0,
            'hpp': 0.6176,
            'atkp': 0.3654,
            'defp': 0.0,
            'em': 0.6803,
            'er': 0.0,
            'cr': 1.0,
            'cd': 0.7764
        },
        '胡桃 | 匣里灭辰 | 追忆4 | 生火暴': {
            'hp': 0.1825,
            'atk': 0.1994,
            'def': 0.0,
            'hpp': 0.5544,
            'atkp': 0.335,
            'defp': 0.0,
            'em': 0.6396,
            'er': 0.0,
            'cr': 0.8474,
            'cd': 1.0
        },
        '胡桃 | 匣里灭辰 | 追忆4 | 精火暴': {
            'hp': 0.2132,
            'atk': 0.2328,
            'def': 0.0,
            'hpp': 0.6475,
            'atkp': 0.3912,
            'defp': 0.0,
            'em': 0.4513,
            'er': 0.0,
            'cr': 0.8474,
            'cd': 1.0
        },
        '胡桃 | 护摩之杖 | 魔女4 | 生火暴': {
            'hp': 0.1808,
            'atk': 0.1517,
            'def': 0.0,
            'hpp': 0.5491,
            'atkp': 0.3249,
            'defp': 0.0,
            'em': 0.9576,
            'er': 0.0,
            'cr': 1.0,
            'cd': 0.7764
        },
        '胡桃 | 护摩之杖 | 魔女4 | 精火暴': {
            'hp': 0.2111,
            'atk': 0.1771,
            'def': 0.0,
            'hpp': 0.6413,
            'atkp': 0.3794,
            'defp': 0.0,
            'em': 0.6163,
            'er': 0.0,
            'cr': 1.0,
            'cd': 0.7764
        },
        '胡桃 | 匣里灭辰 | 魔女4 | 生火暴': {
            'hp': 0.1889,
            'atk': 0.2063,
            'def': 0.0,
            'hpp': 0.5736,
            'atkp': 0.3466,
            'defp': 0.0,
            'em': 0.5811,
            'er': 0.0,
            'cr': 0.8474,
            'cd': 1.0
        },
        '胡桃 | 匣里灭辰 | 魔女4 | 精火暴': {
            'hp': 0.2218,
            'atk': 0.2423,
            'def': 0.0,
            'hpp': 0.6738,
            'atkp': 0.4071,
            'defp': 0.0,
            'em': 0.4151,
            'er': 0.0,
            'cr': 0.8474,
            'cd': 1.0
        },
        '托马 | 西风长枪 | 2旗印2千岩 | 充生暴': {
            'hp': 0.4833,
            'atk': 0.0,
            'def': 0.0,
            'hpp': 0.9751,
            'atkp': 0.0,
            'defp': 0.0,
            'em': 0.0,
            'er': 1.0,
            'cr': 0.0,
            'cd': 0.0
        },
        '托马 | 黑缨枪 | 2旗印2千岩 | 充生生': {
            'hp': 0.32,
            'atk': 0.0,
            'def': 0.0,
            'hpp': 0.6456,
            'atkp': 0.0,
            'defp': 0.0,
            'em': 0.0,
            'er': 1.0,
            'cr': 0.0,
            'cd': 0.0
        },
        '宵宫 | 飞雷之弦振 | 追忆4 | 攻火暴': {
            'hp': 0.0,
            'atk': 0.2899,
            'def': 0.0,
            'hpp': 0.0,
            'atkp': 0.8097,
            'defp': 0.0,
            'em': 0.0,
            'er': 0.0,
            'cr': 1.0,
            'cd': 0.9375
        },
        '宵宫 | 弓藏 | 追忆4 | 攻火暴': {
            'hp': 0.0,
            'atk': 0.2633,
            'def': 0.0,
            'hpp': 0.0,
            'atkp': 0.658,
            'defp': 0.0,
            'em': 0.0,
            'er': 0.0,
            'cr': 0.8474,
            'cd': 1.0
        },
        '烟绯 | 四风原典 | 乐团4 | 攻火暴': {
            'hp': 0.0,
            'atk': 0.3506,
            'def': 0.0,
            'hpp': 0.0,
            'atkp': 0.8918,
            'defp': 0.0,
            'em': 0.9328,
            'er': 0.4459,
            'cr': 0.8936,
            'cd': 1.0
        },
        '烟绯 | 流浪乐章 | 乐团4 | 攻火暴': {
            'hp': 0.0,
            'atk': 0.3792,
            'def': 0.0,
            'hpp': 0.0,
            'atkp': 0.8531,
            'defp': 0.0,
            'em': 0.3675,
            'er': 0.4266,
            'cr': 0.8761,
            'cd': 1.0
        },
        '可莉 | 四风原典 | 魔女4 | 攻火暴': {
            'hp': 0.0,
            'atk': 0.3203,
            'def': 0.0,
            'hpp': 0.0,
            'atkp': 0.8831,
            'defp': 0.0,
            'em': 1.0,
            'er': 0.0,
            'cr': 0.873,
            'cd': 0.977
        },
        '可莉 | 流浪乐章 | 魔女4 | 攻火暴': {
            'hp': 0.0,
            'atk': 0.3522,
            'def': 0.0,
            'hpp': 0.0,
            'atkp': 0.8674,
            'defp': 0.0,
            'em': 0.3832,
            'er': 0.0,
            'cr': 0.8761,
            'cd': 1.0
        },
        '迪卢克 | 狼的末路 | 魔女4 | 精火暴': {
            'hp': 0.0,
            'atk': 0.2732,
            'def': 0.0,
            'hpp': 0.0,
            'atkp': 0.773,
            'defp': 0.0,
            'em': 0.6226,
            'er': 0.3865,
            'cr': 0.8474,
            'cd': 1.0
        },
        '迪卢克 | 螭骨剑 | 魔女4 | 攻火暴': {
            'hp': 0.0,
            'atk': 0.3435,
            'def': 0.0,
            'hpp': 0.0,
            'atkp': 0.8708,
            'defp': 0.0,
            'em': 1.0,
            'er': 0.4354,
            'cr': 0.8638,
            'cd': 0.927
        },
        '辛焱 | 无工之剑 | 2苍白2骑士 | 攻物暴': {
            'hp': 0.0,
            'atk': 0.197,
            'def': 0.0,
            'hpp': 0.0,
            'atkp': 0.5065,
            'defp': 0.0,
            'em': 0.0,
            'er': 0.2533,
            'cr': 0.7697,
            'cd': 1.0
        },
        '辛焱 | 白影剑 | 2苍白2骑士 | 攻物暴': {
            'hp': 0.0,
            'atk': 0.2864,
            'def': 0.0,
            'hpp': 0.0,
            'atkp': 0.6522,
            'defp': 0.0,
            'em': 0.0,
            'er': 0.3261,
            'cr': 0.7697,
            'cd': 1.0
        },
        '辛焱 | 祭礼大剑 | 千岩4 | 防防防': {
            'hp': 0.0,
            'atk': 0.0,
            'def': 0.3972,
            'hpp': 0.0,
            'atkp': 0.0,
            'defp': 1.0,
            'em': 0.0,
            'er': 0.0,
            'cr': 0.0,
            'cd': 0.0
        },
        '辛焱 | 白影剑 | 千岩4 | 防防防': {
            'hp': 0.0,
            'atk': 0.0,
            'def': 0.3972,
            'hpp': 0.0,
            'atkp': 0.0,
            'defp': 1.0,
            'em': 0.0,
            'er': 0.0,
            'cr': 0.0,
            'cd': 0.0
        },
        '安柏 | 终末嗟叹之诗 | 宗室4 | 攻火暴': {
            'hp': 0.0,
            'atk': 0.2386,
            'def': 0.0,
            'hpp': 0.0,
            'atkp': 0.5948,
            'defp': 0.0,
            'em': 0.0,
            'er': 0.2974,
            'cr': 0.7697,
            'cd': 1.0
        },
        '安柏 | 阿莫斯之弓 | 乐团4 | 攻火暴': {
            'hp': 0.0,
            'atk': 0.2306,
            'def': 0.0,
            'hpp': 0.0,
            'atkp': 0.575,
            'defp': 0.0,
            'em': 0.7263,
            'er': 0.0,
            'cr': 0.7697,
            'cd': 1.0
        },
        '香菱 | 天空之脊 | 旗印4 | 充火暴': {
            'hp': 0.0,
            'atk': 0.0,
            'def': 0.0,
            'hpp': 0.0,
            'atkp': 0.0,
            'defp': 0.0,
            'em': 0.849,
            'er': 0.5076,
            'cr': 0.8042,
            'cd': 1.0
        },
        '香菱 | 天空之脊 | 旗印4 | 精火暴': {
            'hp': 0.0,
            'atk': 0.0,
            'def': 0.0,
            'hpp': 0.0,
            'atkp': 0.0,
            'defp': 0.0,
            'em': 0.5601,
            'er': 0.6593,
            'cr': 0.8042,
            'cd': 1.0
        },
        '香菱 | 渔获 | 旗印4 | 充火暴': {
            'hp': 0.0,
            'atk': 0.0,
            'def': 0.0,
            'hpp': 0.0,
            'atkp': 0.0,
            'defp': 0.0,
            'em': 0.8639,
            'er': 0.4964,
            'cr': 0.8961,
            'cd': 1.0
        },
        '香菱 | 渔获 | 旗印4 | 精火暴': {
            'hp': 0.0,
            'atk': 0.0,
            'def': 0.0,
            'hpp': 0.0,
            'atkp': 0.0,
            'defp': 0.0,
            'em': 0.5699,
            'er': 0.6373,
            'cr': 0.8961,
            'cd': 1.0
        },
        '班尼特 | 风鹰剑 | 宗室4 | 充火暴': {
            'hp': 0.0,
            'atk': 0.195,
            'def': 0.0,
            'hpp': 0.0,
            'atkp': 0.5059,
            'defp': 0.0,
            'em': 1.0,
            'er': 0.5521,
            'cr': 0.7651,
            'cd': 0.9941
        },
        '班尼特 | 天空之刃 | 宗室4 | 充火暴': {
            'hp': 0.0,
            'atk': 0.2227,
            'def': 0.0,
            'hpp': 0.0,
            'atkp': 0.5339,
            'defp': 0.0,
            'em': 1.0,
            'er': 0.4322,
            'cr': 0.7687,
            'cd': 0.9764
        },
        '班尼特 | 风鹰剑 | 少女4 | 充生治': {
            'hp': 0.3896,
            'atk': 0.0,
            'def': 0.0,
            'hpp': 0.9434,
            'atkp': 0.0,
            'defp': 0.0,
            'em': 0.0,
            'er': 1.0,
            'cr': 0.0,
            'cd': 0.0
        },
        '班尼特 | 天空之刃 | 少女4 | 充生治': {
            'hp': 0.413,
            'atk': 0.0,
            'def': 0.0,
            'hpp': 1.0,
            'atkp': 0.0,
            'defp': 0.0,
            'em': 0.0,
            'er': 0.8297,
            'cr': 0.0,
            'cd': 0.0
        },
        '神里绫人 | 波乱月白经津 | 回响4 | 攻水暴': {
            'hp': 0.0557,
            'atk': 0.2853,
            'def': 0.0,
            'hpp': 0.1493,
            'atkp': 0.7764,
            'defp': 0.0,
            'em': 0.0,
            'er': 0.0,
            'cr': 1.0,
            'cd': 0.9375
        },
        '神里绫人 | 磐岩结绿 | 沉沦4 | 攻水暴': {
            'hp': 0.1262,
            'atk': 0.2471,
            'def': 0.0,
            'hpp': 0.3379,
            'atkp': 0.6235,
            'defp': 0.0,
            'em': 0.0,
            'er': 0.0,
            'cr': 1.0,
            'cd': 0.8334
        },
        '神里绫人 | 黑剑 | 回响4 | 攻水暴': {
            'hp': 0.0622,
            'atk': 0.3184,
            'def': 0.0,
            'hpp': 0.1666,
            'atkp': 0.7728,
            'defp': 0.0,
            'em': 0.0,
            'er': 0.0,
            'cr': 1.0,
            'cd': 0.9998
        },
        '珊瑚宫心海 | 不灭月华 | 海染4 | 生水治': {
            'hp': 0.083,
            'atk': 0.0229,
            'def': 0.0,
            'hpp': 0.2185,
            'atkp': 0.0579,
            'defp': 0.0,
            'em': 0.0,
            'er': 0.1092,
            'cr': 0.0,
            'cd': 1.0
        },
        '珊瑚宫心海 | 试做金珀 | 海染4 | 生水治': {
            'hp': 0.0848,
            'atk': 0.0263,
            'def': 0.0,
            'hpp': 0.2232,
            'atkp': 0.0588,
            'defp': 0.0,
            'em': 0.0,
            'er': 0.1116,
            'cr': 0.0,
            'cd': 1.0
        },
        '珊瑚宫心海 | 讨龙英杰谭 | 千岩4 | 生生治': {
            'hp': 0.3801,
            'atk': 0.0,
            'def': 0.0,
            'hpp': 1.0,
            'atkp': 0.0,
            'defp': 0.0,
            'em': 0.0,
            'er': 0.0,
            'cr': 0.0,
            'cd': 0.0
        },
        '珊瑚宫心海 | 试做金珀 | 千岩4 | 生生治': {
            'hp': 0.3801,
            'atk': 0.0,
            'def': 0.0,
            'hpp': 1.0,
            'atkp': 0.0,
            'defp': 0.0,
            'em': 0.0,
            'er': 0.0,
            'cr': 0.0,
            'cd': 0.0
        },
        '达达利亚 | 冬极百星 | 2沉沦2角斗 | 攻水暴': {
            'hp': 0.0,
            'atk': 0.0,
            'def': 0.0,
            'hpp': 0.0,
            'atkp': 0.0,
            'defp': 0.0,
            'em': 1.0,
            'er': 0.0,
            'cr': 0.7723,
            'cd': 0.8643
        },
        '达达利亚 | 天空之翼 | 2沉沦2角斗 | 攻水暴': {
            'hp': 0.0,
            'atk': 0.2481,
            'def': 0.0,
            'hpp': 0.0,
            'atkp': 0.7258,
            'defp': 0.0,
            'em': 1.0,
            'er': 0.3629,
            'cr': 0.7727,
            'cd': 0.8677
        },
        '达达利亚 | 弓藏 | 2沉沦2角斗 | 攻水暴': {
            'hp': 0.0,
            'atk': 0.2464,
            'def': 0.0,
            'hpp': 0.0,
            'atkp': 0.5994,
            'defp': 0.0,
            'em': 1.0,
            'er': 0.2997,
            'cr': 0.7651,
            'cd': 0.9941
        },
        '行秋 | 祭礼剑 | 2沉沦2宗室 | 攻水暴': {
            'hp': 0.0,
            'atk': 0.3388,
            'def': 0.0,
            'hpp': 0.0,
            'atkp': 0.6668,
            'defp': 0.0,
            'em': 0.0,
            'er': 0.6081,
            'cr': 0.7697,
            'cd': 1.0
        },
        '行秋 | 磐岩结绿 | 旗印4 | 充水暴': {
            'hp': 0.0736,
            'atk': 0.3992,
            'def': 0.0,
            'hpp': 0.1469,
            'atkp': 0.891,
            'defp': 0.0,
            'em': 0.0,
            'er': 0.7018,
            'cr': 0.9676,
            'cd': 1.0
        },
        '莫娜 | 流浪乐章 | 旗印4 | 攻水暴': {
            'hp': 0.0,
            'atk': 0.3189,
            'def': 0.0,
            'hpp': 0.0,
            'atkp': 0.7624,
            'defp': 0.0,
            'em': 1.0,
            'er': 0.3011,
            'cr': 0.7741,
            'cd': 0.8837
        },
        '莫娜 | 讨龙英杰谭 | 宗室4 | 充水暴': {
            'hp': 0.0,
            'atk': 0.4573,
            'def': 0.0,
            'hpp': 0.0,
            'atkp': 0.9439,
            'defp': 0.0,
            'em': 0.0,
            'er': 0.2578,
            'cr': 0.7697,
            'cd': 1.0
        },
        '莫娜 | 试做金珀 | 宗室4 | 充水暴': {
            'hp': 0.0,
            'atk': 0.4092,
            'def': 0.0,
            'hpp': 0.0,
            'atkp': 0.9784,
            'defp': 0.0,
            'em': 0.0,
            'er': 0.2578,
            'cr': 0.7697,
            'cd': 1.0
        },
        '芭芭拉 | 不灭月华 | 少女4 | 生生治': {
            'hp': 0.5231,
            'atk': 0.0,
            'def': 0.0,
            'hpp': 1.0,
            'atkp': 0.0,
            'defp': 0.0,
            'em': 0.0,
            'er': 0.5,
            'cr': 0.0,
            'cd': 0.0
        },
        '芭芭拉 | 讨龙英杰谭 | 少女4 | 生生治': {
            'hp': 0.5231,
            'atk': 0.0,
            'def': 0.0,
            'hpp': 1.0,
            'atkp': 0.0,
            'defp': 0.0,
            'em': 0.0,
            'er': 0.5,
            'cr': 0.0,
            'cd': 0.0
        },
        '芭芭拉 | 试做金珀 | 少女4 | 生生治': {
            'hp': 0.5231,
            'atk': 0.0,
            'def': 0.0,
            'hpp': 1.0,
            'atkp': 0.0,
            'defp': 0.0,
            'em': 0.0,
            'er': 0.5,
            'cr': 0.0,
            'cd': 0.0
        },
        '早柚 | 狼的末路 | 翠绿4 | 精攻治': {
            'hp': 0.0,
            'atk': 0.3912,
            'def': 0.0,
            'hpp': 0.0,
            'atkp': 1.0,
            'defp': 0.0,
            'em': 0.0,
            'er': 0.5,
            'cr': 0.0,
            'cd': 0.0
        },
        '早柚 | 西风大剑 | 翠绿4 | 精攻治': {
            'hp': 0.0,
            'atk': 0.4776,
            'def': 0.0,
            'hpp': 0.0,
            'atkp': 1.0,
            'defp': 0.0,
            'em': 0.0,
            'er': 0.5,
            'cr': 0.0,
            'cd': 0.0
        },
        '枫原万叶 | 苍古自由之誓 | 翠绿4 | 精精精': {
            'hp': 0.0,
            'atk': 0.0,
            'def': 0.0,
            'hpp': 0.0,
            'atkp': 0.0,
            'defp': 0.0,
            'em': 1.0,
            'er': 0.0,
            'cr': 0.0,
            'cd': 0.0
        },
        '枫原万叶 | 铁蜂刺 | 翠绿4 | 精精精': {
            'hp': 0.0,
            'atk': 0.0,
            'def': 0.0,
            'hpp': 0.0,
            'atkp': 0.0,
            'defp': 0.0,
            'em': 1.0,
            'er': 0.0,
            'cr': 0.0,
            'cd': 0.0
        },
        '魈 | 和璞鸢 | 辰砂4 | 攻风暴': {
            'hp': 0.0,
            'atk': 0.0,
            'def': 0.0,
            'hpp': 0.0,
            'atkp': 0.0,
            'defp': 0.0,
            'em': 0.0,
            'er': 0.0,
            'cr': 0.9339,
            'cd': 1.0
        },
        '魈 | 护摩之杖 | 辰砂4 | 攻风暴': {
            'hp': 0.0326,
            'atk': 0.0,
            'def': 0.0,
            'hpp': 0.081,
            'atkp': 0.0,
            'defp': 0.0,
            'em': 0.0,
            'er': 0.0405,
            'cr': 1.0,
            'cd': 0.9375
        },
        '魈 | 决斗之枪 | 2翠绿2角斗 | 攻风暴': {
            'hp': 0.0,
            'atk': 0.319,
            'def': 0.0,
            'hpp': 0.0,
            'atkp': 0.7684,
            'defp': 0.0,
            'em': 0.0,
            'er': 0.3842,
            'cr': 1.0,
            'cd': 0.8998
        },
        '温迪 | 终末嗟叹之诗 | 翠绿4 | 精精精': {
            'hp': 0.0,
            'atk': 0.0,
            'def': 0.0,
            'hpp': 0.0,
            'atkp': 0.0,
            'defp': 0.0,
            'em': 0.7319,
            'er': 1.0,
            'cr': 0.0,
            'cd': 0.0
        },
        '温迪 | 西风猎弓 | 翠绿4 | 精精精': {
            'hp': 0.0,
            'atk': 0.0,
            'def': 0.0,
            'hpp': 0.0,
            'atkp': 0.0,
            'defp': 0.0,
            'em': 0.9392,
            'er': 1.0,
            'cr': 0.0,
            'cd': 0.0
        },
        '温迪 | 绝弦 | 翠绿4 | 充精精': {
            'hp': 0.0,
            'atk': 0.0,
            'def': 0.0,
            'hpp': 0.0,
            'atkp': 0.0,
            'defp': 0.0,
            'em': 0.9272,
            'er': 1.0,
            'cr': 0.0,
            'cd': 0.0
        },
        '琴 | 腐殖之剑 | 2翠绿2角斗 | 攻攻治': {
            'hp': 0.0,
            'atk': 0.445,
            'def': 0.0,
            'hpp': 0.0,
            'atkp': 1.0,
            'defp': 0.0,
            'em': 0.0,
            'er': 0.7691,
            'cr': 0.0,
            'cd': 0.0
        },
        '琴 | 西风剑 | 2翠绿2角斗 | 攻攻治': {
            'hp': 0.0,
            'atk': 0.481,
            'def': 0.0,
            'hpp': 0.0,
            'atkp': 1.0,
            'defp': 0.0,
            'em': 0.0,
            'er': 0.7248,
            'cr': 0.0,
            'cd': 0.0
        },
        '琴 | 风鹰剑 | 2翠绿2角斗 | 充攻治': {
            'hp': 0.0,
            'atk': 0.3651,
            'def': 0.0,
            'hpp': 0.0,
            'atkp': 1.0,
            'defp': 0.0,
            'em': 0.0,
            'er': 0.6417,
            'cr': 0.0,
            'cd': 0.0
        },
        '砂糖 | 祭礼残章 | 翠绿4 | 充精精': {
            'hp': 0.0,
            'atk': 0.0,
            'def': 0.0,
            'hpp': 0.0,
            'atkp': 0.0,
            'defp': 0.0,
            'em': 1.0,
            'er': 0.0,
            'cr': 0.0,
            'cd': 0.0
        },
        '砂糖 | 试做金珀 | 翠绿4 | 充精精': {
            'hp': 0.0,
            'atk': 0.0,
            'def': 0.0,
            'hpp': 0.0,
            'atkp': 0.0,
            'defp': 0.0,
            'em': 1.0,
            'er': 0.0,
            'cr': 0.0,
            'cd': 0.0
        },
        '砂糖 | 讨龙英杰谭 | 翠绿4 | 充精精': {
            'hp': 0.0,
            'atk': 0.0,
            'def': 0.0,
            'hpp': 0.0,
            'atkp': 0.0,
            'defp': 0.0,
            'em': 1.0,
            'er': 0.0,
            'cr': 0.0,
            'cd': 0.0
        },
        '空/荧（风） | 西风剑 | 翠绿4 | 精精精': {
            'hp': 0.0,
            'atk': 0.0,
            'def': 0.0,
            'hpp': 0.0,
            'atkp': 0.0,
            'defp': 0.0,
            'em': 1.0,
            'er': 0.0,
            'cr': 0.0,
            'cd': 0.0
        },
        '八重神子 | 神乐之真意 | 平雷4 | 攻雷暴': {
            'hp': 0.0,
            'atk': 0.3372,
            'def': 0.0,
            'hpp': 0.0,
            'atkp': 0.959,
            'defp': 0.0,
            'em': 0.4987,
            'er': 0.0,
            'cr': 1.0,
            'cd': 0.9375
        },
        '八重神子 | 天空之卷 | 平雷4 | 攻雷暴': {
            'hp': 0.0,
            'atk': 0.2459,
            'def': 0.0,
            'hpp': 0.0,
            'atkp': 0.7479,
            'defp': 0.0,
            'em': 0.5572,
            'er': 0.0,
            'cr': 0.8474,
            'cd': 1.0
        },
        '八重神子 | 匣里日月 | 平雷4 | 攻雷暴': {
            'hp': 0.0,
            'atk': 0.3788,
            'def': 0.0,
            'hpp': 0.0,
            'atkp': 0.9659,
            'defp': 0.0,
            'em': 0.5525,
            'er': 0.0,
            'cr': 1.0,
            'cd': 0.9998
        },
        '八重神子 | 流浪乐章 | 平雷4 | 攻雷暴': {
            'hp': 0.0,
            'atk': 0.2183,
            'def': 0.0,
            'hpp': 0.0,
            'atkp': 0.5568,
            'defp': 0.0,
            'em': 0.6381,
            'er': 0.0,
            'cr': 0.9997,
            'cd': 1.0
        },
        '雷电将军 | 薙草之稻光 | 旗印4 | 充雷暴': {
            'hp': 0.0,
            'atk': 0.0,
            'def': 0.0,
            'hpp': 0.0,
            'atkp': 0.0,
            'defp': 0.0,
            'em': 0.0,
            'er': 0.4666,
            'cr': 0.7697,
            'cd': 1.0
        },
        '雷电将军 | 渔获 | 旗印4 | 充攻暴': {
            'hp': 0.0,
            'atk': 0.3217,
            'def': 0.0,
            'hpp': 0.0,
            'atkp': 0.8174,
            'defp': 0.0,
            'em': 0.0,
            'er': 0.4279,
            'cr': 0.8961,
            'cd': 1.0
        },
        '九条裟罗 | 天空之翼 | 旗印4 | 充雷暴': {
            'hp': 0.0,
            'atk': 0.0,
            'def': 0.0,
            'hpp': 0.0,
            'atkp': 0.0,
            'defp': 0.0,
            'em': 0.0,
            'er': 0.3881,
            'cr': 1.0,
            'cd': 0.9756
        },
        '九条裟罗 | 祭礼弓 | 旗印4 | 充雷暴': {
            'hp': 0.0,
            'atk': 0.0,
            'def': 0.0,
            'hpp': 0.0,
            'atkp': 0.0,
            'defp': 0.0,
            'em': 0.0,
            'er': 0.2934,
            'cr': 0.7721,
            'cd': 1.0
        },
        '刻晴 | 雾切之回光 | 2如雷2角斗 | 攻雷暴': {
            'hp': 0.0,
            'atk': 0.2886,
            'def': 0.0,
            'hpp': 0.0,
            'atkp': 0.8633,
            'defp': 0.0,
            'em': 0.0,
            'er': 0.0,
            'cr': 1.0,
            'cd': 0.9391
        },
        '刻晴 | 磐岩结绿 | 2如雷2角斗 | 攻雷暴': {
            'hp': 0.0,
            'atk': 0.2662,
            'def': 0.0,
            'hpp': 0.0,
            'atkp': 0.6908,
            'defp': 0.0,
            'em': 0.0,
            'er': 0.0,
            'cr': 1.0,
            'cd': 0.7617
        },
        '刻晴 | 匣里龙吟 | 2如雷2角斗 | 攻雷暴': {
            'hp': 0.0,
            'atk': 0.279,
            'def': 0.0,
            'hpp': 0.0,
            'atkp': 0.6972,
            'defp': 0.0,
            'em': 0.0,
            'er': 0.0,
            'cr': 1.0,
            'cd': 0.9972
        },
        '雷泽 | 螭骨剑 | 角斗4 | 攻物暴': {
            'hp': 0.0,
            'atk': 0.3527,
            'def': 0.0,
            'hpp': 0.0,
            'atkp': 0.7871,
            'defp': 0.0,
            'em': 0.0,
            'er': 0.3936,
            'cr': 0.8762,
            'cd': 1.0
        },
        '雷泽 | 狼的末路 | 角斗4 | 攻物暴': {
            'hp': 0.0,
            'atk': 0.2174,
            'def': 0.0,
            'hpp': 0.0,
            'atkp': 0.5492,
            'defp': 0.0,
            'em': 0.0,
            'er': 0.2746,
            'cr': 0.7697,
            'cd': 1.0
        },
        '菲谢尔 | 绝弦 | 2如雷2角斗 | 攻雷暴': {
            'hp': 0.0,
            'atk': 0.2814,
            'def': 0.0,
            'hpp': 0.0,
            'atkp': 0.6364,
            'defp': 0.0,
            'em': 0.0,
            'er': 0.0,
            'cr': 0.7697,
            'cd': 1.0
        },
        '菲谢尔 | 天空之翼 | 2如雷2角斗 | 攻雷暴': {
            'hp': 0.0,
            'atk': 0.2725,
            'def': 0.0,
            'hpp': 0.0,
            'atkp': 0.7504,
            'defp': 0.0,
            'em': 0.0,
            'er': 0.0,
            'cr': 0.8905,
            'cd': 1.0
        },
        '丽莎 | 四风原典 | 2雷2角斗 | 攻雷暴': {
            'hp': 0.0,
            'atk': 0.3259,
            'def': 0.0,
            'hpp': 0.0,
            'atkp': 0.8212,
            'defp': 0.0,
            'em': 0.0,
            'er': 0.0,
            'cr': 0.8936,
            'cd': 1.0
        },
        '丽莎 | 流浪乐章 | 宗室4 | 攻雷暴': {
            'hp': 0.0,
            'atk': 0.0,
            'def': 0.0,
            'hpp': 0.0,
            'atkp': 0.0,
            'defp': 0.0,
            'em': 0.0,
            'er': 0.0,
            'cr': 0.8761,
            'cd': 1.0
        },
        '北斗 | 狼的末路 | 旗印4 | 充雷暴': {
            'hp': 0.0,
            'atk': 0.2334,
            'def': 0.0,
            'hpp': 0.0,
            'atkp': 0.5833,
            'defp': 0.0,
            'em': 0.0,
            'er': 0.2874,
            'cr': 0.7697,
            'cd': 1.0
        },
        '北斗 | 螭骨剑 | 旗印4 | 充攻暴': {
            'hp': 0.0,
            'atk': 0.3178,
            'def': 0.0,
            'hpp': 0.0,
            'atkp': 0.7008,
            'defp': 0.0,
            'em': 0.0,
            'er': 0.3234,
            'cr': 0.8762,
            'cd': 1.0
        },
        '空/荧（雷） | 西风剑 | 旗印4 | 充雷暴': {
            'hp': 0.0,
            'atk': 0.0,
            'def': 0.0,
            'hpp': 0.0,
            'atkp': 0.0,
            'defp': 0.0,
            'em': 0.0,
            'er': 1.0,
            'cr': 0.0,
            'cd': 0.0
        },
        '申鹤 | 息灾 | 2角斗2追忆 | 攻攻攻': {
            'hp': 0.0,
            'atk': 0.319,
            'def': 0.0,
            'hpp': 0.0,
            'atkp': 1.0,
            'defp': 0.0,
            'em': 0.0,
            'er': 0.7238,
            'cr': 0.0,
            'cd': 0.0
        },
        '申鹤 | 薙草之稻光 | 2角斗2追忆 | 攻攻攻': {
            'hp': 0.0,
            'atk': 0.3655,
            'def': 0.0,
            'hpp': 0.0,
            'atkp': 1.0,
            'defp': 0.0,
            'em': 0.0,
            'er': 0.5906,
            'cr': 0.0,
            'cd': 0.0
        },
        '申鹤 | 天空之脊 | 2角斗2追忆 | 攻攻攻': {
            'hp': 0.0,
            'atk': 0.3408,
            'def': 0.0,
            'hpp': 0.0,
            'atkp': 1.0,
            'defp': 0.0,
            'em': 0.0,
            'er': 0.5787,
            'cr': 0.0,
            'cd': 0.0
        },
        '申鹤 | 西风长枪 | 2角斗2追忆 | 攻攻攻': {
            'hp': 0.0,
            'atk': 0.3836,
            'def': 0.0,
            'hpp': 0.0,
            'atkp': 1.0,
            'defp': 0.0,
            'em': 0.0,
            'er': 0.6021,
            'cr': 0.0,
            'cd': 0.0
        },
        '神里绫华 | 雾切之回光 | 冰风4 | 攻冰暴': {
            'hp': 0.0,
            'atk': 0.1768,
            'def': 0.0,
            'hpp': 0.0,
            'atkp': 0.5389,
            'defp': 0.0,
            'em': 0.0,
            'er': 0.2694,
            'cr': 1.0,
            'cd': 0.4212
        },
        '神里绫华 | 天目影打刀 | 冰风4 | 攻冰暴': {
            'hp': 0.0,
            'atk': 0.192,
            'def': 0.0,
            'hpp': 0.0,
            'atkp': 0.4584,
            'defp': 0.0,
            'em': 0.0,
            'er': 0.2292,
            'cr': 1.0,
            'cd': 0.5349
        },
        '优菈 | 松籁响起之时 | 苍白4 | 攻物暴': {
            'hp': 0.0,
            'atk': 0.0,
            'def': 0.0,
            'hpp': 0.0,
            'atkp': 0.0,
            'defp': 0.0,
            'em': 0.0,
            'er': 0.0,
            'cr': 1.0,
            'cd': 0.9972
        },
        '优菈 | 狼的末路 | 苍白4 | 攻物暴': {
            'hp': 0.0,
            'atk': 0.0,
            'def': 0.0,
            'hpp': 0.0,
            'atkp': 0.0,
            'defp': 0.0,
            'em': 0.0,
            'er': 0.0,
            'cr': 1.0,
            'cd': 0.9972
        },
        '优菈 | 螭骨剑 | 苍白4 | 攻物暴': {
            'hp': 0.0,
            'atk': 0.0,
            'def': 0.0,
            'hpp': 0.0,
            'atkp': 0.0,
            'defp': 0.0,
            'em': 0.0,
            'er': 0.0,
            'cr': 1.0,
            'cd': 0.9077
        },
        '甘雨 | 阿莫斯之弓 | 冰风4 | 攻冰暴': {
            'hp': 0.0,
            'atk': 0.1403,
            'def': 0.0,
            'hpp': 0.0,
            'atkp': 0.397,
            'defp': 0.0,
            'em': 0.0,
            'er': 0.0,
            'cr': 1.0,
            'cd': 0.4165
        },
        '甘雨 | 破魔之弓 | 冰风4 | 攻冰暴': {
            'hp': 0.0,
            'atk': 0.1603,
            'def': 0.0,
            'hpp': 0.0,
            'atkp': 0.3795,
            'defp': 0.0,
            'em': 0.0,
            'er': 0.0,
            'cr': 1.0,
            'cd': 0.4165
        },
        '甘雨 | 试做澹月 | 冰风4 | 攻冰暴': {
            'hp': 0.0,
            'atk': 0.1315,
            'def': 0.0,
            'hpp': 0.0,
            'atkp': 0.3333,
            'defp': 0.0,
            'em': 0.0,
            'er': 0.0,
            'cr': 1.0,
            'cd': 0.4165
        },
        '甘雨 | 阿莫斯之弓 | 乐团4 | 攻冰暴': {
            'hp': 0.0,
            'atk': 0.2242,
            'def': 0.0,
            'hpp': 0.0,
            'atkp': 0.6343,
            'defp': 0.0,
            'em': 0.0,
            'er': 0.0,
            'cr': 1.0,
            'cd': 0.7979
        },
        '甘雨 | 破魔之弓 | 乐团4 | 攻冰暴': {
            'hp': 0.0,
            'atk': 0.2562,
            'def': 0.0,
            'hpp': 0.0,
            'atkp': 0.6063,
            'defp': 0.0,
            'em': 0.0,
            'er': 0.0,
            'cr': 1.0,
            'cd': 0.7979
        },
        '甘雨 | 试做澹月 | 乐团4 | 攻冰暴': {
            'hp': 0.0,
            'atk': 0.2101,
            'def': 0.0,
            'hpp': 0.0,
            'atkp': 0.5325,
            'defp': 0.0,
            'em': 0.0,
            'er': 0.0,
            'cr': 1.0,
            'cd': 0.7979
        },
        '凯亚 | 西风剑 | 旗印4 | 攻冰暴': {
            'hp': 0.0,
            'atk': 0.3908,
            'def': 0.0,
            'hpp': 0.0,
            'atkp': 0.7937,
            'defp': 0.0,
            'em': 0.0,
            'er': 0.2582,
            'cr': 0.9305,
            'cd': 1.0
        },
        '凯亚 | 磐岩结绿 | 旗印4 | 充冰暴': {
            'hp': 0.0,
            'atk': 0.4186,
            'def': 0.0,
            'hpp': 0.0,
            'atkp': 0.9608,
            'defp': 0.0,
            'em': 0.0,
            'er': 0.2986,
            'cr': 1.0,
            'cd': 0.9333
        },
        '重云 | 狼的末路 | 2冰风2宗室 | 攻冰暴': {
            'hp': 0.0,
            'atk': 0.2303,
            'def': 0.0,
            'hpp': 0.0,
            'atkp': 0.5742,
            'defp': 0.0,
            'em': 0.0,
            'er': 0.2871,
            'cr': 0.9305,
            'cd': 1.0
        },
        '重云 | 螭骨剑 | 2冰风2宗室 | 攻冰暴': {
            'hp': 0.0,
            'atk': 0.3589,
            'def': 0.0,
            'hpp': 0.0,
            'atkp': 0.7892,
            'defp': 0.0,
            'em': 0.0,
            'er': 0.3946,
            'cr': 1.0,
            'cd': 0.972
        },
        '七七 | 祭礼剑 | 海染4 | 攻攻治': {
            'hp': 0.0,
            'atk': 0.4498,
            'def': 0.0,
            'hpp': 0.0,
            'atkp': 1.0,
            'defp': 0.0,
            'em': 0.0,
            'er': 0.5,
            'cr': 0.0,
            'cd': 0.0
        },
        '七七 | 风鹰剑 | 海染4 | 攻攻治': {
            'hp': 0.0,
            'atk': 0.3469,
            'def': 0.0,
            'hpp': 0.0,
            'atkp': 1.0,
            'defp': 0.0,
            'em': 0.0,
            'er': 0.5,
            'cr': 0.0,
            'cd': 0.0
        },
        '七七 | 笛剑 | 海染4 | 攻攻治': {
            'hp': 0.0,
            'atk': 0.4182,
            'def': 0.0,
            'hpp': 0.0,
            'atkp': 1.0,
            'defp': 0.0,
            'em': 0.0,
            'er': 0.5,
            'cr': 0.0,
            'cd': 0.0
        },
        '迪奥娜 | 祭礼弓 | 2少女2千岩 | 生生生': {
            'hp': 0.535,
            'atk': 0.0,
            'def': 0.0,
            'hpp': 1.0,
            'atkp': 0.0,
            'defp': 0.0,
            'em': 0.0,
            'er': 0.0,
            'cr': 0.0,
            'cd': 0.0
        },
        '罗莎莉亚 | 西风长枪 | 宗室4 | 攻冰暴': {
            'hp': 0.0,
            'atk': 0.2609,
            'def': 0.0,
            'hpp': 0.0,
            'atkp': 0.6301,
            'defp': 0.0,
            'em': 0.0,
            'er': 0.3151,
            'cr': 0.5946,
            'cd': 1.0
        },
        '埃洛伊 | 西风猎弓 | 2冰风2角斗 | 攻冰暴': {
            'hp': 0.0,
            'atk': 0.3569,
            'def': 0.0,
            'hpp': 0.0,
            'atkp': 0.7365,
            'defp': 0.0,
            'em': 0.0,
            'er': 0.3683,
            'cr': 0.9305,
            'cd': 1.0
        },
        '荒泷一斗 | 赤角石溃杵 | 华馆4 | 防岩暴': {
            'hp': 0.0,
            'atk': 0.1295,
            'def': 0.0,
            'hpp': 0.0,
            'atkp': 0.2988,
            'defp': 0.0,
            'em': 0.0,
            'er': 0.1494,
            'cr': 1.0,
            'cd': 0.8334
        },
        '荒泷一斗 | 螭骨剑 | 华馆4 | 防岩暴': {
            'hp': 0.0,
            'atk': 0.1714,
            'def': 0.0,
            'hpp': 0.0,
            'atkp': 0.379,
            'defp': 0.0,
            'em': 0.0,
            'er': 0.1895,
            'cr': 1.0,
            'cd': 0.9998
        },
        '荒泷一斗 | 白影剑 | 华馆4 | 防岩暴': {
            'hp': 0.0,
            'atk': 0.0,
            'def': 0.0,
            'hpp': 0.0,
            'atkp': 0.0,
            'defp': 0.0,
            'em': 0.0,
            'er': 0.0,
            'cr': 0.8474,
            'cd': 1.0
        },
        '五郎 | 西风猎弓 | 流放4 | 充岩暴': {
            'hp': 0.0,
            'atk': 0.0,
            'def': 0.0,
            'hpp': 0.0,
            'atkp': 0.0,
            'defp': 0.0,
            'em': 0.0,
            'er': 1.0,
            'cr': 0.0,
            'cd': 0.0
        },
        '阿贝多 | 辰砂之纺锤 | 华馆4 | 防岩暴': {
            'hp': 0.0,
            'atk': 0.0,
            'def': 0.2351,
            'hpp': 0.0,
            'atkp': 0.0,
            'defp': 0.649,
            'em': 0.0,
            'er': 0.0,
            'cr': 0.7697,
            'cd': 1.0
        },
        '阿贝多 | 辰砂之纺锤 | 磐岩4 | 防岩暴': {
            'hp': 0.0,
            'atk': 0.0,
            'def': 0.2831,
            'hpp': 0.0,
            'atkp': 0.0,
            'defp': 0.7815,
            'em': 0.0,
            'er': 0.0,
            'cr': 0.7697,
            'cd': 1.0
        },
        '阿贝多 | 辰砂之纺锤 | 千岩4 | 防岩暴': {
            'hp': 0.0,
            'atk': 0.0,
            'def': 0.2831,
            'hpp': 0.0,
            'atkp': 0.0,
            'defp': 0.7815,
            'em': 0.0,
            'er': 0.0,
            'cr': 0.7697,
            'cd': 1.0
        },
        '钟离 | 黑缨枪 | 千岩4 | 生生生': {
            'hp': 0.3484,
            'atk': 0.0,
            'def': 0.0,
            'hpp': 1.0,
            'atkp': 0.0,
            'defp': 0.0,
            'em': 0.0,
            'er': 0.0,
            'cr': 0.0,
            'cd': 0.0
        },
        '钟离 | 护摩之杖 | 千岩4 | 生生生': {
            'hp': 0.1068,
            'atk': 0.1463,
            'def': 0.0,
            'hpp': 0.3065,
            'atkp': 0.3769,
            'defp': 0.0,
            'em': 0.0,
            'er': 0.1885,
            'cr': 0.7786,
            'cd': 1.0
        },
        '钟离 | 护摩之杖 | 2磐岩2宗室 | 生岩暴': {
            'hp': 0.1529,
            'atk': 0.2228,
            'def': 0.0,
            'hpp': 0.4388,
            'atkp': 0.574,
            'defp': 0.0,
            'em': 0.0,
            'er': 0.287,
            'cr': 0.8936,
            'cd': 1.0
        },
        '诺艾尔 | 赤角石溃杵 | 华馆4 | 防岩暴': {
            'hp': 0.0,
            'atk': 0.1264,
            'def': 0.0,
            'hpp': 0.0,
            'atkp': 0.278,
            'defp': 0.0,
            'em': 0.0,
            'er': 0.139,
            'cr': 1.0,
            'cd': 0.8496
        },
        '诺艾尔 | 螭骨剑 | 华馆4 | 防岩暴': {
            'hp': 0.0,
            'atk': 0.1534,
            'def': 0.0,
            'hpp': 0.0,
            'atkp': 0.3227,
            'defp': 0.0,
            'em': 0.0,
            'er': 0.1614,
            'cr': 0.8762,
            'cd': 1.0
        },
        '诺艾尔 | 白影剑 | 华馆4 | 防岩暴': {
            'hp': 0.0,
            'atk': 0.0,
            'def': 0.0,
            'hpp': 0.0,
            'atkp': 0.0,
            'defp': 0.0,
            'em': 0.0,
            'er': 0.0,
            'cr': 0.7697,
            'cd': 1.0
        },
        '凝光 | 四风原典 | 2磐岩2角斗 | 攻岩暴': {
            'hp': 0.0,
            'atk': 0.1835,
            'def': 0.0,
            'hpp': 0.0,
            'atkp': 0.4515,
            'defp': 0.0,
            'em': 0.0,
            'er': 0.2258,
            'cr': 1.0,
            'cd': 0.4932
        },
        '凝光 | 尘世之锁 | 2磐岩2角斗 | 攻岩暴': {
            'hp': 0.0,
            'atk': 0.0,
            'def': 0.0,
            'hpp': 0.0,
            'atkp': 0.0,
            'defp': 0.0,
            'em': 0.0,
            'er': 0.0,
            'cr': 1.0,
            'cd': 0.4933
        },
        '凝光 | 流浪乐章 | 2磐岩2角斗 | 攻岩暴': {
            'hp': 0.0,
            'atk': 0.1925,
            'def': 0.0,
            'hpp': 0.0,
            'atkp': 0.417,
            'defp': 0.0,
            'em': 0.0,
            'er': 0.2085,
            'cr': 1.0,
            'cd': 0.442
        },
        '空/荧（岩） | 雾切之回光 | 2磐岩2角斗 | 攻岩暴': {
            'hp': 0.0,
            'atk': 0.2698,
            'def': 0.0,
            'hpp': 0.0,
            'atkp': 0.717,
            'defp': 0.0,
            'em': 0.0,
            'er': 0.3585,
            'cr': 0.8575,
            'cd': 1.0
        },
        '空/荧（岩） | 磐岩结绿 | 2磐岩2角斗 | 攻岩暴': {
            'hp': 0.0,
            'atk': 0.306,
            'def': 0.0,
            'hpp': 0.0,
            'atkp': 0.6922,
            'defp': 0.0,
            'em': 0.0,
            'er': 0.3461,
            'cr': 0.9676,
            'cd': 1.0
        },
        '空/荧（岩） | 黑剑 | 2磐岩2角斗 | 攻岩暴': {
            'hp': 0.0,
            'atk': 0.3283,
            'def': 0.0,
            'hpp': 0.0,
            'atkp': 0.7111,
            'defp': 0.0,
            'em': 0.0,
            'er': 0.3555,
            'cr': 0.8762,
            'cd': 1.0
        },
        '云堇 | 薙草之稻光 | 华馆4 | 防防防': {
            'hp': 0.0,
            'atk': 0.0,
            'def': 0.4323,
            'hpp': 0.0,
            'atkp': 0.0,
            'defp': 1.0,
            'em': 0.0,
            'er': 0.3485,
            'cr': 0.0,
            'cd': 0.0
        },
        '云堇 | 天空之脊 | 华馆4 | 防防防': {
            'hp': 0.0,
            'atk': 0.0,
            'def': 0.4323,
            'hpp': 0.0,
            'atkp': 0.0,
            'defp': 1.0,
            'em': 0.0,
            'er': 0.3746,
            'cr': 0.0,
            'cd': 0.0
        },
        '云堇 | 西风长枪 | 华馆4 | 防防暴': {
            'hp': 0.0,
            'atk': 0.0,
            'def': 0.4323,
            'hpp': 0.0,
            'atkp': 0.0,
            'defp': 1.0,
            'em': 0.0,
            'er': 0.3483,
            'cr': 0.0,
            'cd': 0.0
        }
    }
}